# Завдання 1
# Дано два рядки. Виведіть на екран символи, які є в обох рядках.

A = {1, 2, 3, 14, 3, 21, 5}
B = {1, 2, 4, 8, 6, 12, 5}
print(B & A)

# Завдання 2 Створіть програму, яка емулює роботу сервісу зі скорочення посилань.
# Повинна бути реалізована можливість введення початкового посилання та короткої назви і отримання початкового
# посилання за її назвою.


my_dict = {"Валер’ян Підмогильний": "Місто", "Юрій Яновський": "Майстер корабля", "Остап Вишня": "Моя автобіографія"}
name = input("ведіть автора: Валер’ян Підмогильний, Юрій Яновський, Остап Вишня ")
a = my_dict[name]
print(a)


# Завдання 3
# Створіть функцію, яка на вхід отримує 2 списки цілочисельних значень, і повертає список унікальних значень
# без повтору, які є в 1 списку (немає в другому) і навпаки


line1 = [2, 3, 4, 8, 6, 44, 2, 78]
line2 = [6, 7, 8, 9, 4, 85, 21, 13]
def fun(line1, line2):
    x = set(line1) - set(line2)
    y = set(line2) - set(line1)
    print(x)
    print(y)
fun(line1, line2)