# Создайте функцию от произвольного количества аргументов, которая вычисляет среднее арифметическое данных чисел.
# Вычислите при помощи неё среднее арифметическое двух заданных чисел и среднее арифметическое чисел из заданного диапазона.\

def sums():
    my_list = [4, 24, 17, 14]
    a = sum(my_list)
    b = len(my_list)
    print("The arithmetic mean of the list is", a / b)


sums()

# Напишите программу, которая вводит с клавиатуры текст и выводит отсортированные по
# алфавиту слова данного текста.


list1 = ["ball", "book", "because", "add"]
list1.sort()
print(list1)


# Напишите программу, которая вводит с клавиатуры последовательность чисел и выводит её
# отсортированной в порядке возрастания.


my_list = [4, 24, 17, 14]
my_list.sort()
print(my_list)




